[
    {
        "title": "Java Full Stack Developer",
        "company": "University of Maryland Medical System",
        "location": "Baltimore, MD",
        "dates": "Oct 2023 – Present",
        "description": [
            "Led the design and implementation of <b>Microservices</b> architecture, transitioning from a monolithic system to improve scalability and deployment efficiency using <b>Spring Boot</b>.",
            "Developed and optimized serverless workflows using <b>AWS Lambda</b>, setting up real-time monitoring with <b>AWS CloudWatch</b> for better performance tracking.",
            "Built responsive and interactive user interfaces with <b>React</b> and <b>Angular</b>, enhancing user experience and integrating seamless data communication via APIs.",
            "Automated deployment and CI/CD processes with <b>Jenkins</b> and <b>Docker</b>, ensuring efficient and reliable software delivery.",
            "Implemented comprehensive data processing and logging mechanisms using <b>Apache Kafka</b> and <b>Log4j</b>, enabling effective monitoring and analytics."
        ],
        "skills": [
            "AWS Lambda", "Spring Boot", "Microservices", "CloudWatch", "React", "Angular",
            "Jenkins", "Docker", "Apache Kafka", "Log4j", "MongoDB", "JIRA", "Flux Architecture",
            "PCF", "Java 8", "Stream API", "LESS/SCSS", "Node.js", "Cassandra", "JMS", "J2EE",
            "Spring MVC", "ETL", "XML", "XSLT", "Informatica", "Agile", "SCRUM"
        ]
    },
    {
        "title": "Java Full Stack Developer",
        "company": "Piedmont Airlines",
        "location": "Salisbury, MD",
        "dates": "Nov 2022 – Sep 2023",
        "description": [
            "Worked in an <b>Agile</b> environment, contributing to sprint planning and daily stand-ups, ensuring effective team collaboration and project delivery.",
            "Designed and developed a validation service on the <b>Spring MVC</b> framework, integrating it with a SQL database and building a responsive UI feature.",
            "Implemented and managed <b>Kubernetes</b> for container orchestration, ensuring high availability and scalability of distributed applications.",
            "Defined resources and automated infrastructure using <b>Azure Resource Manager (ARM)</b> templates, optimizing resource provisioning.",
            "Developed and deployed <b>Spring Boot Microservices</b>, creating and consuming REST APIs to support modular and scalable system architecture."
        ],
        "skills": [
            "Agile", "Spring MVC", "SQL", "Kubernetes", "Azure Resource Manager (ARM)", 
            "Spring Boot", "Microservices", "REST API", "Jira", "Apache Kafka", "Oracle", 
            "Jenkins", "Soap UI", "HTML", "Bootstrap", "CSS", "JavaScript", "AngularJS", "XML"
        ]
    },
    {
        "title": "Specialist Programmer",
        "company": "Infosys Ltd.",
        "location": "Hyderabad, India",
        "dates": "Nov 2020 – Aug 2022",
        "description": [
            "Developed and optimized <b>RESTful APIs</b> using <b>Spring Boot</b> and <b>Java</b>, improving response times with <b>Redis</b> caching and query optimization.",
            "Led the design and deployment of a multi-language compilation engine with <b>Docker</b>, <b>AWS ECS</b>, and <b>Redis Streams</b> for large-scale coding competitions.",
            "Migrated backend services from monolithic architecture to <b>microservices</b>, enhancing scalability and performance in a distributed cloud environment.",
            "Automated CI/CD pipelines using <b>Jenkins</b>, <b>Kubernetes</b>, and <b>AWS CodeDeploy</b>, streamlining software delivery and infrastructure management.",
            "Implemented security and monitoring solutions with <b>OAuth2</b>, <b>Spring Security</b>, and <b>AWS CloudWatch</b>, ensuring API protection and system observability."
        ],
        "skills": [
            "RESTful APIs", "Spring Boot", "Java", "Redis", "Docker", "AWS ECS", "Redis Streams",
            "Microservices", "Jenkins", "Kubernetes", "AWS CodeDeploy", "OAuth2", "Spring Security",
            "AWS CloudWatch", "CloudTrail", "Agile", "SCRUM", "Lean", "Git", "Hibernate", 
            "Spring Data", "PL/SQL", "Oracle", "React", "Bootstrap", "JavaScript", "AWS SQS",
            "ElastiCache", "Kafka", "AWS Lambda", "Amazon RDS", "JUnit", "Mockito", "MongoDB"
        ]
    },
    {
        "title": "Java Full Stack Developer",
        "company": "Experian",
        "location": "Hyderabad, India",
        "dates": "Sep 2018 – Oct 2020",
        "description": [
            "Designed and developed scalable <b>Microservices</b> and web applications using <b>Java</b> and <b>Spring Framework</b>, enhancing data management and integration efficiency.",
            "Utilized <b>Hibernate</b> ORM to map data from MVC models to <b>Oracle</b> relational schema, optimizing database interactions and performance.",
            "Implemented asynchronous messaging with <b>JMS</b> and real-time communication using <b>Socket.IO</b>, <b>HTML</b>, <b>CSS</b>, and <b>JavaScript</b> for dynamic front-end functionality.",
            "Developed and managed <b>Cassandra</b> clusters and automated server provisioning on <b>EC2</b> using Chef, ensuring robust infrastructure.",
            "Actively participated in <b>SCRUM</b> practices, contributing to pair programming, maintaining data accuracy with JSON parsers, and performing performance testing with <b>JMeter</b>."
        ],
        "skills": [
            "Microservices", "Java", "Spring Framework", "Hibernate", "Oracle", "JMS", "Socket.IO",
            "HTML", "CSS", "JavaScript", "Cassandra", "EC2", "Chef", "SCRUM", "JUnit", "JSON",
            "Node.js", "JAX-WS", "SOAP", "JMeter", "Git", "GitHub", "CVS", "Bitbucket", "SVN",
            "Service Oriented Architecture (SOA)", "JDBC", "Multithreading"
        ]
    }
    
]
