[
    {
        "title": "E-commerce Application for Liquor Store",
        "description": [
            "Developed a full-stack e-commerce platform for a liquor store with <b>React</b> frontend and <b>Java Spring Boot</b> backend, ensuring a seamless shopping experience.",
            "Integrated Elasticsearch for product search and auto-suggestions, improving search efficiency and user experience.",
            "Utilized <b>AWS S3</b> for frontend hosting, <b>AWS CloudFront</b> for content delivery, and <b>AWS Route 53</b> for domain management, ensuring fast and secure global access.",
            "Deployed backend services on AWS EC2 using Jenkins for CI/CD, and managed infrastructure with AWS CloudFormation, including security groups, VPC, Elastic Load Balancing (ALB), and Amazon RDS with Postgres for efficient and scalable database management."
        ],
        "summary": "A robust e-commerce platform for a liquor store, featuring advanced search capabilities, seamless frontend-backend integration, and AWS-powered deployment for a fast, secure, and scalable shopping experience.",
        "backendLink": "https://github.com/rohith4743/inventory_backend",
        "frontendLink": "https://github.com/rohith4743/liquor-store-frontend",
        "projectLink": "https://liquor-store.rohithkankipati.com"
    },
    {
        "title": "Loan Application Platform",
        "summary": "A comprehensive loan application platform enabling secure application processing, real-time notifications, and scalable backend deployment on Google Cloud, optimized for high availability and performance.",
        "description": [
            "Developed a web-based platform using <b>React</b> to allow users to fill out loan applications with <b>Google Maps API</b> for address autofill and Google reCAPTCHA for verification.",
            "Built a secure portal for users to view and manage applications, using <b>Amazon Aurora</b> for storing application data and <b>Kafka</b> for real-time updates.",
            "Integrated real-time notifications using AWS SNS to provide status updates. Implemented auto-scaling (ASG) and CloudWatch logs for high availability and monitoring.",
            "Deployed backend services using <b>Node.js</b> on <b>Google Cloud Platform (GCP)</b>, integrated <b>New Relic</b> alongside <b>Datadog</b> for comprehensive performance monitoring, logging, and metrics tracking."
        ],
        "backendLink": null,
        "frontendLink": null,
        "projectLink": null
    },
    {
        "title": "Task Management Application",
        "summary": "A task scheduling application with real-time notifications, enabling users to manage daily tasks effectively with a responsive Angular frontend and a scalable Java Spring Boot backend.",
        "description": [
            "Developed a task scheduling platform using <b>Angular</b> for the frontend and <b>Java Spring Boot</b> for the backend, enabling users to create, update, and manage daily tasks.",
            "Built a real-time notification system using WebSocket for instant updates, ensuring a seamless user experience.",
            "Used <b>MongoDB</b> for task data storage, providing scalable and efficient management of user tasks and schedules."
        ],
        "backendLink": "https://github.com/rohith4743/sked_backend",
        "frontendLink": "https://github.com/rohith4743/sked",
        "projectLink": null
    }
]